Revit 2024 API
Curve.CreateReversed Method
 Creates a new curve with the opposite orientation of the existing curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public Curve CreateReversed()
Visual Basic
Public Function CreateReversed As Curve
Visual C++
public:
Curve^ CreateReversed()
Return Value
 The new curve.
See Also
Curve Class
Autodesk.Revit.DB Namespace